Repository: raccoongang/credentials
Catalog: credentials/conf/locale/*/LC_MESSAGES/django.po
Languages: ar, fa_ir

source: Personal info
ar: المعلومات الشخصية
fa_ir: اطلاعات شخصی

source: Permissions
ar: الصلاحيات
fa_ir: دسترسی‌ها

source: Important dates
ar: تواريخ مهمّة
fa_ir: تاریخ‌های مهم

source: URLs
ar: الروابط
fa_ir: نشانی‌های اینترنتی

source: Social Sharing
ar: المشاركة على مواقع التواصل الاجتماعي
fa_ir: اشتراک‌گذاری اجتماعی

source: A Facebook app ID is required to enable Facebook sharing.
ar: معرّف تطبيق فيسبوك مطلوب لتمكين المشاركة عبر فيسبوك.
fa_ir: شناسه برنامه فیس‌بوک برای فعالسازی اشتراک‌گذاری در آن الزامی است.

source: Platform Name
ar: اسم المنصة
fa_ir: نام پلتفورم

source: Name of your Open edX platform
ar: اسم منصة edX المفتوحة
fa_ir: نام پلتفرم Open edX شما

source: Segment Key
ar: مفتاح القسم
fa_ir: کلید ناحیه

source: Segment write/API key.
ar: كتابة القسم/مفتاح API.
fa_ir: بخش نوشتن/کلید API.

source: Theme Name
ar: اسم الوضع
fa_ir: نام قالب

source: Name of of the theme to use for this site. This value should be lower-cased.
ar: اسم الوضع الذي سيتم استخدامه لهذا الموقع، يجب أن تكون هذه القيمة في حالة الأحرف الصغيرة.
fa_ir: نام قالب مورد استفاده برای این وبگاه. این مقدار باید با حروف کوچک درج شده باشد.

source: LMS base url for custom site
ar: رابط قاعدة نظام إدارة التعلّم ’LMS‘ للموقع المُخصّص
fa_ir: نشانی اینترنتی پایه مدیریت آموزشی مجازی برای وبگاه سفارشی

source: Root URL of this site's LMS (e.g. https://courses.stage.edx.org)
ar: رابط المصدر لموقع نظام إدارة التعلّم (مثال https://courses.stage.edx.org)
fa_ir: نشانی اینترنتی ریشه این وبگاه آموزشی مجازی: (مثلا: https://courses.stage.edx.org)

source: Catalog API URL
ar: رابط كتالوج API

source: Root URL of the Catalog API (e.g. https://api.edx.org/catalog/v1/)
ar: رابط المصدر لكتالوج API (e.g. https://api.edx.org/catalog/v1/)
fa_ir: نشانی اینترنتی ریشه کاتالوگ API (مثلا https://api.edx.org/catalog/v1/)

source: Terms of Service URL
ar: رابط شروط الخدمة
fa_ir: نشانی اینترنتی شرایط ارائه خدمات

source: Privacy Policy URL
ar: رايط سياسة الخصوصية
fa_ir: نشانی اینترنتی سیاست‌ حفظ حریم خصوصی

source: Homepage URL
ar: رابط الصفحة الرئيسية
fa_ir: نشانی اینترنتی صفحه اصلی

source: Company Name
ar: اسم الشركة
fa_ir: نام شرکت

source: Verified Certificate URL
ar: رابط الشهادة الموثقّة
fa_ir: نشانی اینترنتی گواهی تاییدشده

source: Certificate Help URL
ar: رابط المساعدة بشأن الشهادة
fa_ir: نشانی اینترنتی راهنمای گواهی

source: URL of page for questions about certificates
ar: رابط صفحة الأسئلة حول الشهادات
fa_ir: نشانی اینترنتی صفحه سوالات مربوط به گواهی‌ها

source: Enable Learner Records
ar: تمكين سجلات المتعلم
fa_ir: پیشینه یادگیرنده را فعال کنید

source: Enable the Records feature. The LMS has a similar setting.
ar: تفعيل خاصيّة السجلات، لدى نظام إدارة التعلم الإعدادات نفسها.
fa_ir: قابلیت پیشینه‌ها را فعال کنید. سازمان آموزش مجازی، تنظیمات مشابهی دارد.

source: Learner Records Help URL
ar: رابط صفحة المساعدة لسجلات المتعلّم
fa_ir: نشانی اینترنتی راهنمای پیشینه‌های یادگیرنده

source: URL of page for questions about Learner Records
ar: رابط صفحة الأسئلة حول سجلات المتعلم
fa_ir: نشانی اینترنتی برای سوالات مربوط به پیشینه‌های یادگیرنده

source: Facebook App ID
ar: معرّف فيسبوك
fa_ir: شناسه برنامه فیس‌بوک

source: Facebook app ID used for sharing
ar: معرّف تطبيق فيسبوك للمشاركة
fa_ir: شناسه برنامه فیس‌بوک استفاده‌شده برای اشتراک‌گذاری

source: Twitter Username
ar: اسم المستخدم في تويتر
fa_ir: نام کاربری توئیتر

source: Twitter username included in tweeted credentials. Do NOT include @.
ar: تضمين اسم المستخدم لتويتر في الوثائق المعتمدة في التغريدات، لا تقم بتضمينها @.
fa_ir: نام کاربری توئیتر در اطلاعات کاربری توییت‌شده گنجانده شده است. @ را وارد نکنید.

source: Enable Facebook sharing
ar: تمكين المشاركة على فيسبوك
fa_ir: اشتراک‌گذاری فیس‌بوک را فعال کنید

source: Enable sharing via Facebook
ar: تمكين المشاركة عبر فيسبوك
fa_ir: اشتراک‌گذاری در فیس‌بوک را فعال کنید

source: Enable LinkedIn sharing
ar: تمكين المشاركة على لينكد إن
fa_ir: اشتراک‌گذاری لینکدین را فعال کنید

source: Enable sharing via LinkedIn
ar: تمكين المشاركة عبر لينكد إن
fa_ir: اشتراک‌گذاری در لینکداین را فعال کنید

source: Enable Twitter sharing
ar: تمكين المشاركة على تويتر
fa_ir: اشتراک‌گذاری در توئیتر را فعال کنید

source: Enable sharing via Twitter
ar: تمكين المشاركة عبر تويتر
fa_ir: اشتراک‌گذاری در توئیتر را فعال کنید

source: Full Name
ar: الاسم الكامل
fa_ir: نام و نام خانوادگی

source: All authoring organizations of the program MUST have a certificate image defined!
ar: يجب أن يكون لدى جميع المنظمات في البرنامج صورة شهادة محددة!
fa_ir: همه سازمان‌های نویسنده برنامه باید تصویر گواهی تعریف‌شده داشته باشند!

source: The image file size must be less than 250KB.
ar: يجب أن يكون حجم ملف الصورة أقل من 250 كيلو بايت.
fa_ir: اندازه پرونده تصویری باید کمتر از 250 کیلوبایت باشد.

source: Invalid course key.
ar: مفتاح الدورة التدريبية غير صالح.
fa_ir: کلید دوره آموزشی نامعتبر است.

source: Signatory organization name if its different from issuing organization.
ar: اسم المؤسسة الموقعة في حال كان مختلف عن اسم المؤسسة المُصدرة.
fa_ir: نام سازمان امضاکننده در صورتی که با سازمان صادرکننده متفاوت باشد.

source: Image must be square PNG files. The file size should be under 250KB.
ar: يجب أن تكون الصورة بصيغة PNG مربعة. يجب ألا يتجاوز حجم الملف 250 كيلو بايت.
fa_ir: تصویر باید فایل PNG مربعی باشد. اندازه پرونده باید کمتر از 250 کیلوبایت باشد.

source: awarded
ar: تم المنح
fa_ir: اعطا شد

source: revoked
ar: تم الإلغاء
fa_ir: لغو شد

source: URL at which the credential can be downloaded
ar: رابط الصفحة من حيث يمكن تنزيل الشهادات
fa_ir: نشانی اینترنتی که در آن اعتبارنامه قابل بارگیری است

source: Program UUID
ar: معرف البرنامج العالمي الخاص
fa_ir: پیشرفت UUID

source: Display the associated organization's name (e.g. ACME University) instead of its short name (e.g. ACMEx)
ar: عرض اسم المؤسسة الشريكة (على سبيل المثال: جامعة ACME) بدلاً من الاسم المختصر (مثلاً: ACMEx)
fa_ir: نمایش نام سازمان مرتبط (مانند دانشگاه ACME) به جای نام کوتاه آن (مانند ACMEx)

source: Use organization name
ar: استخدم اسم المؤسسة
fa_ir: از نام سازمان استفاده کنید

source: I completed a course at {platform_name}. Take a look at my certificate:
ar: لقد أكملت مساقًا على {platform_name}. شاهد شهادتي:
fa_ir: من یک دوره آموزشی را در {platform_name} گذراندم. به گواهی من نگاهی بیندازید:

source: {first_org} and {second_org}
ar: {first_org} و {second_org}
fa_ir: {first_org} و {second_org}

source: {series_of_orgs}, and {last_org}
ar: {series_of_orgs}، و {last_org}
fa_ir: {series_of_orgs}, و {last_org}

source: successfully completed all courses and received passing grades for a Professional Certificate in
ar: أكمل بنجاح جميع الدورات التعليمية وحصل على درجت الكافية للحصول على شهادة مهنية في
fa_ir: تمام دوره‌های آموزشی را با موفقیت گذراند و نمرات قبولی را برای دریافت گواهی حرفه‌ای کسب کرد

source: Professional Certificate
ar: شهادة مهنية
fa_ir: گواهی حرفه ای

source: Cache cleared.
ar: تم حذف بيانات التخزين المؤقت.
fa_ir: حافظه پاک شد.

source: {action} is not a valid action.
ar: {action} ليس إجراءً صالحًا.
fa_ir: {action} اقدامی معتبر نیست.

source: N/A
ar: غير متوفر
fa_ir: ناشناخته

source: sent
ar: تم الإرسال
fa_ir: ارسال‌شده

source: other
ar: أخرى
fa_ir: سایر موارد

source: User credit pathways can only be connected to credit pathways.
ar: يمكن ربط مسارات الوحدات الدراسية للمستخدم بمسارات الوحدات الدراسية فقط.
fa_ir: مسیرهای اعتباری کاربر فقط می‌توانند به مسیرهای اعتباری متصل شوند.

source: My Learner Records
ar: سجلات متعلّمي
fa_ir: پیشینه‌های یادگیرنده من

source: A program record is created once you have earned at least one course certificate in a program.
ar: يمكن إنشاء سجل برنامج فور حصولك على شهادة مساق في برنامج
fa_ir: یک پیشینه از برنامه زمانی ساخته می‌شود که حداقل یک گواهی دوره آموزشی را در یک برنامه کسب کنید.

source: Program Listing View
ar: عرض قوائم البرنامج
fa_ir: نمای فهرست برنامه

source: The following is a list of all active programs for which program records are being generated.
ar: مايلي قائمة بالبرامج المفعلة التي يُنشأ لأجلها سجلات البرنامج
fa_ir: در زیر فهرستی آمده است از همه برنامه‌های فعالی که پیشینه‌های برنامه برای آن‌ها تولید می‌شود.

source: Page Not Found
ar: الصفحة التي طلبتها غير موجودة
fa_ir: صفحه مورد نظر یافت نشد

source: Server Error
ar: خطأ في الخادم
fa_ir: خطای سرویس‌دهنده

source: Print or share your certificate
ar: اطبع أو شارك شهادتك
fa_ir: چاپ یا اشتراک‌گذاری گواهی شما

source: Share this certificate via Facebook
ar: شارك هذه الشهادة عبر فيسبوك
fa_ir: این گواهی را از طریق فیس‌بوک به اشتراک بگذارید

source: Tweet this certificate
ar: أرسل هذه الشهادة في تغريدة
fa_ir: توییت این گواهی

source: Add to LinkedIn profile
ar: إضافة إلى ملف شخصي على لينكد إن
fa_ir: افزودن به پرونده لینکداین

source: Add this certificate to your LinkedIn profile
ar: أضف هذه الشهادة إلى ملفك الشخصي على لينكد إن
fa_ir: افزودن این گواهی به پرونده لینکداین

source: Print
ar: طباعة
fa_ir: چاپ

source: Print this certificate
ar: اطبع هذه الشهادة
fa_ir: چاپ این گواهی

source: Legal Policies
ar: السياسات القانونية
fa_ir: سیاست‌های حقوقی

source: Terms of Service & Honor Code
ar: شروط الخدمة وميثاق الشرف
fa_ir: شرایط استفاده از خدمات و اصول اخلاقی

source: Privacy Policy
ar: سياسة الخصوصية
fa_ir: قواعد حفظ حریم خصوصی

source: All rights reserved except where noted. edX, Open edX and the edX and Open edX logos are registered trademarks or trademarks of edX Inc.
ar: جميع الحقوق محفوظة إلا إذا تم الإشارة إلى غير ذلك. تعد edX وOpen edX وشعارات edX وOpen EdX علامات تجارية مسجلة التابعة لمؤسسة edX Inc.
fa_ir: تمامی حقوق محفوظ است به جز موارد مذکور در edX، Open edX و نشانی‌های تجاری edX و Open edX علائم تجاری یا علائم تجاری ثبت‌شده edX Inc هستند.

source: Powered by
ar: بإدارة
fa_ir: تولید شده توسط

source: Skip to main content
ar: الانتقال إلى المحتوى الرئيسي
fa_ir: برو به محتوای اصلی

source: Congratulations, %(user_name)s!
ar: تهانينا، %(user_name)s
fa_ir: تبریک می‌گوییم، %(user_name)s!

source: You worked hard to earn your certificate from %(platform_name)s — share it with colleagues, friends, and family to get the word out about what you mastered in %(program_display_name)s.
ar: لقد عملت بجد للحصول على الشهادة من %(platform_name)s — شاركها مع الزملاء والأصدقاء والعائلة لتهنئتك على تحقيق إنجازك في %(program_display_name)s.
fa_ir: شما سخت تلاش کردید تا گواهی خود را از%(platform_name)s_به دست آورید — آن را با همکاران، دوستان و خانواده به اشتراک بگذارید تا اطلاع یابند از آنچه در%(program_display_name)s بر آن تسلط یافته‌اید.

source: Go to %(platform_name)s Home Page
ar: انتقل إلى الصفحة الرئيسية لـ %(platform_name)s
fa_ir: به %(platform_name)s صفحۀ اصلی برو

source: All rights reserved
ar: جميع الحقوق محفوظة
fa_ir: همه حقوق محفوظ است

source: Hello
ar: مرحبًا
fa_ir: سلام

source: Congratulations on completing the %(program_title)s %(program_type)s Program!
ar: تهانينا لإتمامك برنامج %(program_title)s%(program_type)s!
fa_ir: بابت تکمیل برنامه%(program_title)s%(program_type)sتبریک می‌گویم!

source: Sincerely,<br/>The %(platform_name)s Team
ar: مع التحية. <br/>فريق منصة %(platform_name)s
fa_ir: با احترام،<br/> تیم %(platform_name)s

source: Sincerely
ar: مع التحية
fa_ir: با احترام

source: The %(platform_name)s Team
ar: فريق %(platform_name)s
fa_ir: تیم %(platform_name)s

source: Congratulations for finishing your %(program_title)s %(program_type)s Program!
ar: تهانينا لإتمامك برنامج %(program_title)s%(program_type)s!
fa_ir: برای اتمام برنامه %(program_title)s %(program_type)sخود به شما تبریک می‌گویم!

source: Supported by the following organizations
ar: مدعومة من المؤسسات التالية
fa_ir: حمایت شده توسط سازمان‌های زیر

source: logo
ar: الشعار
fa_ir: نشان تجاری

source: {start_span}This is to certify that{end_span} {start_strong} {user_name} {end_strong}
ar: {start_span}هذا للمصادقة على أن{end_span} {start_strong} {user_name} {end_strong}
fa_ir: {start_span}این برای تأیید آن است که{end_span} {start_strong} {user_name} {end_strong}

source: a program offered by %(org_name_string)s, in collaboration with %(platform_name)s.
ar: قدمت %(org_name_string)sالبرنامج بالتعاون مع %(platform_name)s.
fa_ir: برنامه‌ای که توسط %(org_name_string)s با همکاری %(platform_name)sارائه می‌شود.

source: Noted by
ar: لاحظها
fa_ir: یادداشت شده توسط

source: Issued {month} {year}
ar: صادر في {month} {year}
fa_ir: منتشرشده {month} {year}

source: Valid Certificate ID
ar: مُعرف شهادة صالح
fa_ir: شناسه گواهی معتبر

source: Effort
ar: المجهود
fa_ir: تلاش

source: %(num_hours)s hour
ar: %(num_hours)s ساعة
fa_ir: %(num_hours)s ساعت

source: For tips and tricks on printing your certificate, view the {start_anchor}Web Certificates help documentation{end_anchor}.
ar: للحصول على نصائح ولمحات حول طباعة الشهادة، يمكنك الاطلاع على {start_anchor}صفحة مساعدة توثيق شهادات الويب{end_anchor}.
fa_ir: برای نکات و ترفندهای مربوط به چاپ گواهی، {start_anchor}مستندات راهنمای گواهی‌های وب{end_anchor} را مشاهده کنید.

source: Management View
ar: عرض الإدارة
fa_ir: نمای مدیریت

source: Clear cache
ar: مسح بيانات التخزين المؤقت
fa_ir: پاک‌کردن حافظه

source: {program_name} Record
ar: سجل {program_name}
fa_ir: {program_name} پیشینه

source: %(user_full_name)s has sent an updated program record for %(program_name)s.
ar: قام %(user_full_name)sبإرسال سجل البرنامج المحدَّث لـ%(program_name)s.
fa_ir: %(user_full_name)sیک پیشینه از برنامه روزآمد برای %(program_name)sارسال کرده است.

source: %(user_full_name)s has sent their completed program record for %(program_name)s.
ar: قام %(user_full_name)sبإرسال سجل البرنامج الكامل لـ%(program_name)s.
fa_ir: %(user_full_name)sپیشینه کامل برنامه خود را برای %(program_name)sارسال کرده است.

source: %(user_full_name)s has sent their partially completed program record for %(program_name)s.
ar: قام %(user_full_name)s بإرسال سجل البرنامج المكتمل جزئيًا لـ %(program_name)s
fa_ir: %(user_full_name)sپیشینه برنامه تا حدی کامل‌شده خود را برای %(program_name)sارسال کرده است.

source: %(user_full_name)s would like to apply for credit in the %(pathway_name)s.
ar: يرغب المستخدم %(user_full_name)s بالالتحاق بالوحدة الدراسية في %(pathway_name)s.
fa_ir: %(user_full_name)sمایل است برای دریافت اعتبار در %(pathway_name)sدرخواست دهد.

source: Please view or download %(user_full_name)s’s public program record to determine their credit eligibility status.
ar: يرجى عرض أو تحميل سجل البرنامج العام لـ %(user_full_name)sلتحديد حالة الأهلية.
fa_ir: لطفاً سابقه برنامه عمومی%(user_full_name)sرا مشاهده یا بارگیری کنید تا وضعیت واجد شرایط بودن اعتبار آن‌ها را مشخص کنید.

source: View Program Record
ar: عرض سجل البرنامج
fa_ir: مشاهده سابقه برنامه

source: Download Record (CSV)
ar: تحميل السجل (CSV)
fa_ir: بارگیری پیشینه (CSV)

source: %(program_name)s Updated Credit Request for %(user_full_name)s
ar: %(program_name)s تحديث طلب الائتمان للمستخدم %(user_full_name)s
fa_ir: %(program_name)s درخواست اعتبار روزآمد برای %(user_full_name)ss

source: %(program_name)s Credit Request for %(user_full_name)s
ar: %(program_name)s طلب الائتمان للمستخدم %(user_full_name)s
fa_ir: %(program_name)sدرخواست اعتبار برای %(user_full_name)s

source: Credentials Administration
ar: إدارة الاعتماد
fa_ir: مدیریت اعتبارنامه‌ها

source: The certificate available date and time that is set in Studio and copied to Credentials. This should be edited in Studio.
fa_ir: تاریخ و ساعت موجود در گواهی که در هنرکده تنظیم شده و در اعتبارنامه کپی شده است. این باید در هنرکده ویرایش شود.
